# 💥 Primeros pasos con ``Python`` y ``SQL`` 💥

|| <a style="background-color: #1bf8ff; color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">27 de Mayo del 2025</a> ||
<a style="background-color: #1bf8ff; color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">Clase 4</a> ||
<a style="background-color: #1bf8ff; color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">Cursos PyM</a> ||
<a style="background-color: #1bf8ff; color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">Luis Fernando Apáez Álvarez</a> ||

## 🪗Acordeón de clase🪗



**Objetivo de clase:** Complementar la automatización montando ahora la generación de la base de datos y la tabla, adicionalmente agregando una función para realizar consultas a la tabla.

Para lograr imprimir el ticket anterior aprenderemos:

<a style="background-color:rgb(213, 255, 27); color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">+Funciones</a> &nbsp; &nbsp; <a style="background-color:rgb(213, 255, 27); color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">+SQL</a> &nbsp; &nbsp; <a style="background-color:rgb(213, 255, 27); color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">POO</a> &nbsp; &nbsp; <a style="background-color:rgb(213, 255, 27); color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">+Fechas</a> &nbsp; &nbsp; <a style="background-color:rgb(213, 255, 27); color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">POO</a>
&nbsp; &nbsp; <a style="background-color:rgb(213, 255, 27); color: #000000; border: none; padding: 10px 15px; border-radius: 5px;">Crear una librería</a>

1. Ver mas de POO
2. Ver puro SQL
3. aprender a usar pandas
4. ver condicionales
5. mejorar el proyecto ---> que implementen lo del range de fechas

En la clase anterior conseguimos realizar la automatización del código de nuestro proyecto, además, comenzamos esta clase subiendo nuestro proyecto a github, así como una exploración en los _codespaces_ que nos permiten programar en la nube.

Comenzaremos esta clase abordando más temas sobre consultas en SQL.

In [1]:
# Realizamos la importacion de las librerias y definimos una 
# funcion para hacer consultas de manera más limpia
import sqlite3 as sql
import pandas as pd

def consulta(query):
    """
    Realiza una consulta a la base de datos y devuelve un DataFrame.
    
    :param query: Consulta SQL a ejecutar.
    :return: DataFrame con los resultados de la consulta.
    """
    # Nos conectamos a la base de datos
    con = sql.connect('ventas.db')
    # Usando pandas, ejecutamos la consulta y guardamos el resultado en un DataFrame
    consulta = pd.read_sql_query(query, con)
    # Cerramos la conexión
    con.close()
    return consulta

**1. Instrucción DISTINCT**

Nos permite ver los valores únicos de una columna, la utilizaremos para ver las fechas que están cargadas en nuestra tabla:

In [2]:
query = """
SELECT 
    DISTINCT Fecha
FROM
    ventas
"""

# Ejecutamos la consulta y guardamos el resultado en un DataFrame
consulta(query)

         Fecha
0   2025-01-02
1   2025-01-03
2   2025-01-01
3   2025-01-04
4   2025-01-05
5   2025-01-06
6   2025-01-07
7   2025-01-08
8   2025-01-09
9   2025-01-10
10  2025-01-11
11  2025-01-12
12  2025-01-13
13  2025-01-14
14  2025-01-15
15  2025-01-16
16  2025-01-17
17  2025-01-18
18  2025-01-19
19  2025-01-20
20  2025-01-21
21  2025-01-22
22  2025-01-23
23  2025-01-24
24  2025-01-25
25  2025-01-26
26  2025-01-27
27  2025-01-28
28  2025-01-29
29  2025-01-30
30  2025-01-31

Con lo cual vemos que tenemos cargada la información de todo enero. Esta instrucción es muy útil cuando quieres ver todas las categorías o valores únicos e una columna de interés.

**2. Recordatorio de filtros con WHERE**

Para recordar cómo hacer filtros, intentemos responder la siguiente pregunta:

¿Cuál fue el producto más caro vendido en la sucursa _Xochimilco_?

In [ ]:
# Primero filtramos a la sucursal de interes
query = """
--- La siguiente consulta se traduce al español como:
--- Selecciona todas las columnas de la tabla ventas
--- donde la sucursal es 'Xochimilco'
SELECT
    *
FROM
    ventas
WHERE
    Sucursal = 'Xochimilco'
"""

consulta(query).head(10)

        Fecha    Producto    Clave  Cantidad   Precio      Total    Sucursal
0  2025-01-02      Cables  QJS-121        44  1250.85   55037.40  Xochimilco
1  2025-01-02    Libretas  TDU-168        29    33.37     967.73  Xochimilco
2  2025-01-02     Tablets  NRQ-338        26  3106.42   80766.92  Xochimilco
3  2025-01-02  Sacapuntas  PPO-765        49  2868.10  140536.90  Xochimilco
4  2025-01-02  Borradores  USU-861        14  1035.29   14494.06  Xochimilco
5  2025-01-02  Cartulinas  CZS-779        10   106.93    1069.30  Xochimilco
6  2025-01-02       Cajas  VNM-315        29  3951.11  114582.19  Xochimilco
7  2025-01-02    Pinturas  QND-987        29  5742.10  166520.90  Xochimilco
8  2025-01-02   Monitores  MUO-291        39   134.45    5243.55  Xochimilco
9  2025-01-02  Cargadores  ADS-695        24   910.89   21861.36  Xochimilco

In [6]:
# Tomando como base el query anterior, ahora solo basta con ordenar
# de mayor a menor por medio de la columna precio
# y hacemos un limit 1
query = """
SELECT
    --- Solo querremos ver algunas columnas informativas
    --- de acuerdo con la pregunta
    Fecha,
    Producto,
    Precio
FROM
    ventas
WHERE
    Sucursal = 'Xochimilco'
ORDER BY
    Precio DESC
LIMIT 1
"""

consulta(query).head(10)

        Fecha  Producto   Precio
0  2025-01-14  Pinturas  9627.94

**3. Instrucción GROUP BY**

Imagina que nos solicitan obtener el total de ventas en el mes para cada una de las sucursales. Con base en el conocimiento que poseemos, más un plus, podemos obtener:

In [9]:
# Dentro de SQL tenemos funciones de agregación
# como SUM, COUNT, AVG, MIN, MAX, etc.
query = """
SELECT
    --- Podemos darles alias a las columnas
    SUM(Total) AS Total_Ventas
FROM
    ventas
WHERE
    Sucursal = 'Xochimilco'
"""

consulta(query)

   Total_Ventas
0  2.133044e+08

Aprovechando que el valor obtenido está en notación científica, tenemos 

**3.1 Instrucción CAST**

Nos permite convertir valores a un tipo de dato de interés, por ejemplo, en el código anterior tenemos que la consulta nos arroja un valor en notación científica, y nos gustaría que se viera comoun número entero para mejor legibilidad, de tal suerte tenemos

In [ ]:

query = """
SELECT
    --- CAST(valor AS tipo) convierte un valor a un tipo específico
    CAST(SUM(Total) AS INTEGER) AS Total_Ventas
FROM
    ventas
WHERE
    Sucursal = 'Xochimilco'
"""

consulta(query)

   Total_Ventas
0     213304417

Por otro lado, qué tal si separamos esa cifra por miles. Antes de ver cómo hacerlo en SQL, veamos que en Python tenemos lo siguiente:

In [15]:
cifra = 1000

# Separamo en miles la cifra anterior
"{:,}".format(cifra)

'1,000'

de donde:

* {:,} es una cadena de formato donde : indica que se usará un formato especial y , especifica que se deben usar comas para separar los miles.
* .format(cifra) reemplaza {:,} por el valor de cifra ya formateado.

Por lo cual podríamos hacer una función:

In [16]:
def formato_miles(n):
    """
    Formatea un número entero a una cadena con separadores de miles.
    :param n: Número entero a formatear.
    :return: Cadena con el número formateado.
    """
    return "{:,}".format(n)

# Probamos la función con un número
resultado = formato_miles(1234567)
print(resultado)

1,234,567

En SQLITE no existe una función directamente que nos permite separa por miles, como si existe en otros manejadores como postgreSQL o MySQL, pero . . . ¿qué tal si subimos la función que definimos en Python a SQLITE?

In [1]:
# Nos conectamos a a memoria base de SQLITE3
conn = sql.connect(":memory:")

# Subimos la funcion e Python
# 1. Nombre que le daremos a esa funcion
# 2. Cantidad de argumentos que recibe
# 3. La función que hemos definido en Python
conn.create_function("formato_miles", 1, formato_miles)

NameError: name 'sql' is not defined